MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB412/mcu.h
/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD7 ODCDbits.ODCD7
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11
#define _ODCD12 ODCDbits.ODCD12
#define _ODCD13 ODCDbits.ODCD13
#define _ODCD14 ODCDbits.ODCD14
#define _ODCD15 ODCDbits.ODCD15

/* ANSD */
#define _ANSD0 ANSDbits.ANSD0
#define _ANSD1 ANSDbits.ANSD1
#define _ANSD2 ANSDbits.ANSD2
#define _ANSD3 ANSDbits.ANSD3
#define _ANSD4 ANSDbits.ANSD4
#define _ANSD5 ANSDbits.ANSD5
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSD8 ANSDbits.ANSD8
#define _ANSD9 ANSDbits.ANSD9
#define _ANSD10 ANSDbits.ANSD10
#define _ANSD11 ANSDbits.ANSD11
#define _ANSD12 ANSDbits.ANSD12
#define _ANSD13 ANSDbits.ANSD13
#define _ANSD14 ANSDbits.ANSD14
#define _ANSD15 ANSDbits.ANSD15
#define _ANSELD0 ANSDbits.ANSELD0
#define _ANSELD1 ANSDbits.ANSELD1
#define _ANSELD2 ANSDbits.ANSELD2
#define _ANSELD3 ANSDbits.ANSELD3
#define _ANSELD4 ANSDbits.ANSELD4
#define _ANSELD5 ANSDbits.ANSELD5
#define _ANSELD6 ANSDbits.ANSELD6
#define _ANSELD7 ANSDbits.ANSELD7
#define _ANSELD8 ANSDbits.ANSELD8
#define _ANSELD9 ANSDbits.ANSELD9
#define _ANSELD10 ANSDbits.ANSELD10
#define _ANSELD11 ANSDbits.ANSELD11
#define _ANSELD12 ANSDbits.ANSELD12
#define _ANSELD13 ANSDbits.ANSELD13
#define _ANSELD14 ANSDbits.ANSELD14
#define _ANSELD15 ANSDbits.ANSELD15

/* IOCPD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD15 cannot be defined because it is used by more than one SFR */

/* IOCND */
#define _IOCND0 IOCNDbits.IOCND0
#define _IOCND1 IOCNDbits.IOCND1
#define _IOCND2 IOCNDbits.IOCND2
#define _IOCND3 IOCNDbits.IOCND3
#define _IOCND4 IOCNDbits.IOCND4
#define _IOCND5 IOCNDbits.IOCND5
#define _IOCND6 IOCNDbits.IOCND6
#define _IOCND7 IOCNDbits.IOCND7
#define _IOCND8 IOCNDbits.IOCND8
#define _IOCND9 IOCNDbits.IOCND9
#define _IOCND10 IOCNDbits.IOCND10
#define _IOCND11 IOCNDbits.IOCND11
#define _IOCND12 IOCNDbits.IOCND12
#define _IOCND13 IOCNDbits.IOCND13
#define _IOCND14 IOCNDbits.IOCND14
#define _IOCND15 IOCNDbits.IOCND15

/* IOCFD */
#define _IOCFD0 IOCFDbits.IOCFD0
#define _IOCFD1 IOCFDbits.IOCFD1
#define _IOCFD2 IOCFDbits.IOCFD2
#define _IOCFD3 IOCFDbits.IOCFD3
#define _IOCFD4 IOCFDbits.IOCFD4
#define _IOCFD5 IOCFDbits.IOCFD5
#define _IOCFD6 IOCFDbits.IOCFD6
#define _IOCFD7 IOCFDbits.IOCFD7
#define _IOCFD8 IOCFDbits.IOCFD8
#define _IOCFD9 IOCFDbits.IOCFD9
#define _IOCFD10 IOCFDbits.IOCFD10
#define _IOCFD11 IOCFDbits.IOCFD11
#define _IOCFD12 IOCFDbits.IOCFD12
#define _IOCFD13 IOCFDbits.IOCFD13
#define _IOCFD14 IOCFDbits.IOCFD14
#define _IOCFD15 IOCFDbits.IOCFD15

/* CNPUD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD15 cannot be defined because it is used by more than one SFR */
#define _IOCPUD0 CNPUDbits.IOCPUD0
#define _IOCPUD1 CNPUDbits.IOCPUD1
#define _IOCPUD2 CNPUDbits.IOCPUD2
#define _IOCPUD3 CNPUDbits.IOCPUD3
#define _IOCPUD4 CNPUDbits.IOCPUD4
#define _IOCPUD5 CNPUDbits.IOCPUD5
#define _IOCPUD6 CNPUDbits.IOCPUD6
#define _IOCPUD7 CNPUDbits.IOCPUD7
#define _IOCPUD8 CNPUDbits.IOCPUD8
#define _IOCPUD9 CNPUDbits.IOCPUD9
#define _IOCPUD10 CNPUDbits.IOCPUD10
#define _IOCPUD11 CNPUDbits.IOCPUD11
#define _IOCPUD12 CNPUDbits.IOCPUD12
#define _IOCPUD13 CNPUDbits.IOCPUD13
#define _IOCPUD14 CNPUDbits.IOCPUD14
#define _IOCPUD15 CNPUDbits.IOCPUD15
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11
#define _CNPUD12 CNPUDbits.CNPUD12
#define _CNPUD13 CNPUDbits.CNPUD13
#define _CNPUD14 CNPUDbits.CNPUD14
#define _CNPUD15 CNPUDbits.CNPUD15

