MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB412/mcu.h
/* CNPUG */
/* Bitname _IOCPG0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG15 cannot be defined because it is used by more than one SFR */
#define _IOCPUG0 CNPUGbits.IOCPUG0
#define _IOCPUG1 CNPUGbits.IOCPUG1
#define _IOCPUG2 CNPUGbits.IOCPUG2
#define _IOCPUG3 CNPUGbits.IOCPUG3
#define _IOCPUG6 CNPUGbits.IOCPUG6
#define _IOCPUG7 CNPUGbits.IOCPUG7
#define _IOCPUG8 CNPUGbits.IOCPUG8
#define _IOCPUG9 CNPUGbits.IOCPUG9
#define _IOCPUG12 CNPUGbits.IOCPUG12
#define _IOCPUG13 CNPUGbits.IOCPUG13
#define _IOCPUG14 CNPUGbits.IOCPUG14
#define _IOCPUG15 CNPUGbits.IOCPUG15
#define _CNPUG0 CNPUGbits.CNPUG0
#define _CNPUG1 CNPUGbits.CNPUG1
#define _CNPUG2 CNPUGbits.CNPUG2
#define _CNPUG3 CNPUGbits.CNPUG3
#define _CNPUG6 CNPUGbits.CNPUG6
#define _CNPUG7 CNPUGbits.CNPUG7
#define _CNPUG8 CNPUGbits.CNPUG8
#define _CNPUG9 CNPUGbits.CNPUG9
#define _CNPUG12 CNPUGbits.CNPUG12
#define _CNPUG13 CNPUGbits.CNPUG13
#define _CNPUG14 CNPUGbits.CNPUG14
#define _CNPUG15 CNPUGbits.CNPUG15

/* CNPDG */
#define _IOCPDG0 CNPDGbits.IOCPDG0
#define _IOCPDG1 CNPDGbits.IOCPDG1
#define _IOCPDG2 CNPDGbits.IOCPDG2
#define _IOCPDG3 CNPDGbits.IOCPDG3
#define _IOCPDG6 CNPDGbits.IOCPDG6
#define _IOCPDG7 CNPDGbits.IOCPDG7
#define _IOCPDG8 CNPDGbits.IOCPDG8
#define _IOCPDG9 CNPDGbits.IOCPDG9
#define _IOCPDG12 CNPDGbits.IOCPDG12
#define _IOCPDG13 CNPDGbits.IOCPDG13
#define _IOCPDG14 CNPDGbits.IOCPDG14
#define _IOCPDG15 CNPDGbits.IOCPDG15
#define _CNPDG0 CNPDGbits.CNPDG0
#define _CNPDG1 CNPDGbits.CNPDG1
#define _CNPDG2 CNPDGbits.CNPDG2
#define _CNPDG3 CNPDGbits.CNPDG3
#define _CNPDG6 CNPDGbits.CNPDG6
#define _CNPDG7 CNPDGbits.CNPDG7
#define _CNPDG8 CNPDGbits.CNPDG8
#define _CNPDG9 CNPDGbits.CNPDG9
#define _CNPDG12 CNPDGbits.CNPDG12
#define _CNPDG13 CNPDGbits.CNPDG13
#define _CNPDG14 CNPDGbits.CNPDG14
#define _CNPDG15 CNPDGbits.CNPDG15

/* TRISH */
#define _TRISH0 TRISHbits.TRISH0
#define _TRISH1 TRISHbits.TRISH1
#define _TRISH2 TRISHbits.TRISH2
#define _TRISH3 TRISHbits.TRISH3
#define _TRISH4 TRISHbits.TRISH4
#define _TRISH5 TRISHbits.TRISH5
#define _TRISH6 TRISHbits.TRISH6
#define _TRISH7 TRISHbits.TRISH7
#define _TRISH8 TRISHbits.TRISH8
#define _TRISH9 TRISHbits.TRISH9
#define _TRISH10 TRISHbits.TRISH10
#define _TRISH11 TRISHbits.TRISH11
#define _TRISH12 TRISHbits.TRISH12
#define _TRISH13 TRISHbits.TRISH13
#define _TRISH14 TRISHbits.TRISH14
#define _TRISH15 TRISHbits.TRISH15

/* PORTH */
#define _RH0 PORTHbits.RH0
#define _RH1 PORTHbits.RH1
#define _RH2 PORTHbits.RH2
#define _RH3 PORTHbits.RH3
#define _RH4 PORTHbits.RH4
#define _RH5 PORTHbits.RH5
#define _RH6 PORTHbits.RH6
#define _RH7 PORTHbits.RH7
#define _RH8 PORTHbits.RH8
#define _RH9 PORTHbits.RH9
#define _RH10 PORTHbits.RH10
#define _RH11 PORTHbits.RH11
#define _RH12 PORTHbits.RH12
#define _RH13 PORTHbits.RH13
#define _RH14 PORTHbits.RH14
#define _RH15 PORTHbits.RH15

/* LATH */
#define _LATH0 LATHbits.LATH0
#define _LATH1 LATHbits.LATH1
#define _LATH2 LATHbits.LATH2
#define _LATH3 LATHbits.LATH3
#define _LATH4 LATHbits.LATH4
#define _LATH5 LATHbits.LATH5
#define _LATH6 LATHbits.LATH6
#define _LATH7 LATHbits.LATH7
#define _LATH8 LATHbits.LATH8
#define _LATH9 LATHbits.LATH9
#define _LATH10 LATHbits.LATH10
#define _LATH11 LATHbits.LATH11
#define _LATH12 LATHbits.LATH12
#define _LATH13 LATHbits.LATH13
#define _LATH14 LATHbits.LATH14
#define _LATH15 LATHbits.LATH15

/* ODCH */
#define _ODCH0 ODCHbits.ODCH0
#define _ODCH1 ODCHbits.ODCH1
#define _ODCH2 ODCHbits.ODCH2
#define _ODCH3 ODCHbits.ODCH3
#define _ODCH4 ODCHbits.ODCH4
#define _ODCH5 ODCHbits.ODCH5
#define _ODCH6 ODCHbits.ODCH6
#define _ODCH7 ODCHbits.ODCH7
#define _ODCH8 ODCHbits.ODCH8
#define _ODCH9 ODCHbits.ODCH9
#define _ODCH10 ODCHbits.ODCH10
#define _ODCH11 ODCHbits.ODCH11
#define _ODCH12 ODCHbits.ODCH12
#define _ODCH13 ODCHbits.ODCH13
#define _ODCH14 ODCHbits.ODCH14
#define _ODCH15 ODCHbits.ODCH15

/* ANSELH */
#define _ANSH0 ANSELHbits.ANSH0
#define _ANSH1 ANSELHbits.ANSH1
#define _ANSH2 ANSELHbits.ANSH2
#define _ANSH3 ANSELHbits.ANSH3
#define _ANSH4 ANSELHbits.ANSH4
#define _ANSELH0 ANSELHbits.ANSELH0
#define _ANSELH1 ANSELHbits.ANSELH1
#define _ANSELH2 ANSELHbits.ANSELH2
#define _ANSELH3 ANSELHbits.ANSELH3
#define _ANSELH4 ANSELHbits.ANSELH4

/* IOCPH */
/* Bitname _IOCPH0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPH15 cannot be defined because it is used by more than one SFR */

