MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB412/mcu.h
#define _IOCPA_IOCPA2_POSITION                   0x00000002
#define _IOCPA_IOCPA2_MASK                       0x00000004
#define _IOCPA_IOCPA2_LENGTH                     0x00000001

#define _IOCPA_IOCPA3_POSITION                   0x00000003
#define _IOCPA_IOCPA3_MASK                       0x00000008
#define _IOCPA_IOCPA3_LENGTH                     0x00000001

#define _IOCPA_IOCPA4_POSITION                   0x00000004
#define _IOCPA_IOCPA4_MASK                       0x00000010
#define _IOCPA_IOCPA4_LENGTH                     0x00000001

#define _IOCPA_IOCPA5_POSITION                   0x00000005
#define _IOCPA_IOCPA5_MASK                       0x00000020
#define _IOCPA_IOCPA5_LENGTH                     0x00000001

#define _IOCPA_IOCPA6_POSITION                   0x00000006
#define _IOCPA_IOCPA6_MASK                       0x00000040
#define _IOCPA_IOCPA6_LENGTH                     0x00000001

#define _IOCPA_IOCPA7_POSITION                   0x00000007
#define _IOCPA_IOCPA7_MASK                       0x00000080
#define _IOCPA_IOCPA7_LENGTH                     0x00000001

#define _IOCPA_IOCPA9_POSITION                   0x00000009
#define _IOCPA_IOCPA9_MASK                       0x00000200
#define _IOCPA_IOCPA9_LENGTH                     0x00000001

#define _IOCPA_IOCPA10_POSITION                  0x0000000A
#define _IOCPA_IOCPA10_MASK                      0x00000400
#define _IOCPA_IOCPA10_LENGTH                    0x00000001

#define _IOCPA_IOCPA14_POSITION                  0x0000000E
#define _IOCPA_IOCPA14_MASK                      0x00004000
#define _IOCPA_IOCPA14_LENGTH                    0x00000001

#define _IOCPA_IOCPA15_POSITION                  0x0000000F
#define _IOCPA_IOCPA15_MASK                      0x00008000
#define _IOCPA_IOCPA15_LENGTH                    0x00000001

#define _IOCNA_IOCNA0_POSITION                   0x00000000
#define _IOCNA_IOCNA0_MASK                       0x00000001
#define _IOCNA_IOCNA0_LENGTH                     0x00000001

#define _IOCNA_IOCNA1_POSITION                   0x00000001
#define _IOCNA_IOCNA1_MASK                       0x00000002
#define _IOCNA_IOCNA1_LENGTH                     0x00000001

#define _IOCNA_IOCNA2_POSITION                   0x00000002
#define _IOCNA_IOCNA2_MASK                       0x00000004
#define _IOCNA_IOCNA2_LENGTH                     0x00000001

#define _IOCNA_IOCNA3_POSITION                   0x00000003
#define _IOCNA_IOCNA3_MASK                       0x00000008
#define _IOCNA_IOCNA3_LENGTH                     0x00000001

#define _IOCNA_IOCNA4_POSITION                   0x00000004
#define _IOCNA_IOCNA4_MASK                       0x00000010
#define _IOCNA_IOCNA4_LENGTH                     0x00000001

#define _IOCNA_IOCNA5_POSITION                   0x00000005
#define _IOCNA_IOCNA5_MASK                       0x00000020
#define _IOCNA_IOCNA5_LENGTH                     0x00000001

#define _IOCNA_IOCNA6_POSITION                   0x00000006
#define _IOCNA_IOCNA6_MASK                       0x00000040
#define _IOCNA_IOCNA6_LENGTH                     0x00000001

#define _IOCNA_IOCNA7_POSITION                   0x00000007
#define _IOCNA_IOCNA7_MASK                       0x00000080
#define _IOCNA_IOCNA7_LENGTH                     0x00000001

#define _IOCNA_IOCNA9_POSITION                   0x00000009
#define _IOCNA_IOCNA9_MASK                       0x00000200
#define _IOCNA_IOCNA9_LENGTH                     0x00000001

#define _IOCNA_IOCNA10_POSITION                  0x0000000A
#define _IOCNA_IOCNA10_MASK                      0x00000400
#define _IOCNA_IOCNA10_LENGTH                    0x00000001

#define _IOCNA_IOCNA14_POSITION                  0x0000000E
#define _IOCNA_IOCNA14_MASK                      0x00004000
#define _IOCNA_IOCNA14_LENGTH                    0x00000001

#define _IOCNA_IOCNA15_POSITION                  0x0000000F
#define _IOCNA_IOCNA15_MASK                      0x00008000
#define _IOCNA_IOCNA15_LENGTH                    0x00000001

#define _IOCFA_IOCFA0_POSITION                   0x00000000
#define _IOCFA_IOCFA0_MASK                       0x00000001
#define _IOCFA_IOCFA0_LENGTH                     0x00000001

#define _IOCFA_IOCFA1_POSITION                   0x00000001
#define _IOCFA_IOCFA1_MASK                       0x00000002
#define _IOCFA_IOCFA1_LENGTH                     0x00000001

#define _IOCFA_IOCFA2_POSITION                   0x00000002
#define _IOCFA_IOCFA2_MASK                       0x00000004
#define _IOCFA_IOCFA2_LENGTH                     0x00000001

#define _IOCFA_IOCFA3_POSITION                   0x00000003
#define _IOCFA_IOCFA3_MASK                       0x00000008
#define _IOCFA_IOCFA3_LENGTH                     0x00000001

#define _IOCFA_IOCFA4_POSITION                   0x00000004
#define _IOCFA_IOCFA4_MASK                       0x00000010
#define _IOCFA_IOCFA4_LENGTH                     0x00000001

#define _IOCFA_IOCFA5_POSITION                   0x00000005
#define _IOCFA_IOCFA5_MASK                       0x00000020
#define _IOCFA_IOCFA5_LENGTH                     0x00000001

#define _IOCFA_IOCFA6_POSITION                   0x00000006
#define _IOCFA_IOCFA6_MASK                       0x00000040
#define _IOCFA_IOCFA6_LENGTH                     0x00000001

#define _IOCFA_IOCFA7_POSITION                   0x00000007
#define _IOCFA_IOCFA7_MASK                       0x00000080
#define _IOCFA_IOCFA7_LENGTH                     0x00000001

#define _IOCFA_IOCFA9_POSITION                   0x00000009
#define _IOCFA_IOCFA9_MASK                       0x00000200
#define _IOCFA_IOCFA9_LENGTH                     0x00000001

#define _IOCFA_IOCFA10_POSITION                  0x0000000A
#define _IOCFA_IOCFA10_MASK                      0x00000400
#define _IOCFA_IOCFA10_LENGTH                    0x00000001

#define _IOCFA_IOCFA14_POSITION                  0x0000000E
#define _IOCFA_IOCFA14_MASK                      0x00004000
#define _IOCFA_IOCFA14_LENGTH                    0x00000001

#define _IOCFA_IOCFA15_POSITION                  0x0000000F
#define _IOCFA_IOCFA15_MASK                      0x00008000
#define _IOCFA_IOCFA15_LENGTH                    0x00000001

#define _CNPUA_IOCPA0_POSITION                   0x00000000
#define _CNPUA_IOCPA0_MASK                       0x00000001
#define _CNPUA_IOCPA0_LENGTH                     0x00000001

#define _CNPUA_IOCPA1_POSITION                   0x00000001
#define _CNPUA_IOCPA1_MASK                       0x00000002
#define _CNPUA_IOCPA1_LENGTH                     0x00000001

