MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB412/mcu.h
#define _ANSD_ANSD14_POSITION                    0x0000000E
#define _ANSD_ANSD14_MASK                        0x00004000
#define _ANSD_ANSD14_LENGTH                      0x00000001

#define _ANSD_ANSD15_POSITION                    0x0000000F
#define _ANSD_ANSD15_MASK                        0x00008000
#define _ANSD_ANSD15_LENGTH                      0x00000001

#define _ANSD_ANSELD0_POSITION                   0x00000000
#define _ANSD_ANSELD0_MASK                       0x00000001
#define _ANSD_ANSELD0_LENGTH                     0x00000001

#define _ANSD_ANSELD1_POSITION                   0x00000001
#define _ANSD_ANSELD1_MASK                       0x00000002
#define _ANSD_ANSELD1_LENGTH                     0x00000001

#define _ANSD_ANSELD2_POSITION                   0x00000002
#define _ANSD_ANSELD2_MASK                       0x00000004
#define _ANSD_ANSELD2_LENGTH                     0x00000001

#define _ANSD_ANSELD3_POSITION                   0x00000003
#define _ANSD_ANSELD3_MASK                       0x00000008
#define _ANSD_ANSELD3_LENGTH                     0x00000001

#define _ANSD_ANSELD4_POSITION                   0x00000004
#define _ANSD_ANSELD4_MASK                       0x00000010
#define _ANSD_ANSELD4_LENGTH                     0x00000001

#define _ANSD_ANSELD5_POSITION                   0x00000005
#define _ANSD_ANSELD5_MASK                       0x00000020
#define _ANSD_ANSELD5_LENGTH                     0x00000001

#define _ANSD_ANSELD6_POSITION                   0x00000006
#define _ANSD_ANSELD6_MASK                       0x00000040
#define _ANSD_ANSELD6_LENGTH                     0x00000001

#define _ANSD_ANSELD7_POSITION                   0x00000007
#define _ANSD_ANSELD7_MASK                       0x00000080
#define _ANSD_ANSELD7_LENGTH                     0x00000001

#define _ANSD_ANSELD8_POSITION                   0x00000008
#define _ANSD_ANSELD8_MASK                       0x00000100
#define _ANSD_ANSELD8_LENGTH                     0x00000001

#define _ANSD_ANSELD9_POSITION                   0x00000009
#define _ANSD_ANSELD9_MASK                       0x00000200
#define _ANSD_ANSELD9_LENGTH                     0x00000001

#define _ANSD_ANSELD10_POSITION                  0x0000000A
#define _ANSD_ANSELD10_MASK                      0x00000400
#define _ANSD_ANSELD10_LENGTH                    0x00000001

#define _ANSD_ANSELD11_POSITION                  0x0000000B
#define _ANSD_ANSELD11_MASK                      0x00000800
#define _ANSD_ANSELD11_LENGTH                    0x00000001

#define _ANSD_ANSELD12_POSITION                  0x0000000C
#define _ANSD_ANSELD12_MASK                      0x00001000
#define _ANSD_ANSELD12_LENGTH                    0x00000001

#define _ANSD_ANSELD13_POSITION                  0x0000000D
#define _ANSD_ANSELD13_MASK                      0x00002000
#define _ANSD_ANSELD13_LENGTH                    0x00000001

#define _ANSD_ANSELD14_POSITION                  0x0000000E
#define _ANSD_ANSELD14_MASK                      0x00004000
#define _ANSD_ANSELD14_LENGTH                    0x00000001

#define _ANSD_ANSELD15_POSITION                  0x0000000F
#define _ANSD_ANSELD15_MASK                      0x00008000
#define _ANSD_ANSELD15_LENGTH                    0x00000001

#define _ANSELD_ANSD0_POSITION                   0x00000000
#define _ANSELD_ANSD0_MASK                       0x00000001
#define _ANSELD_ANSD0_LENGTH                     0x00000001

#define _ANSELD_ANSD1_POSITION                   0x00000001
#define _ANSELD_ANSD1_MASK                       0x00000002
#define _ANSELD_ANSD1_LENGTH                     0x00000001

#define _ANSELD_ANSD2_POSITION                   0x00000002
#define _ANSELD_ANSD2_MASK                       0x00000004
#define _ANSELD_ANSD2_LENGTH                     0x00000001

#define _ANSELD_ANSD3_POSITION                   0x00000003
#define _ANSELD_ANSD3_MASK                       0x00000008
#define _ANSELD_ANSD3_LENGTH                     0x00000001

#define _ANSELD_ANSD4_POSITION                   0x00000004
#define _ANSELD_ANSD4_MASK                       0x00000010
#define _ANSELD_ANSD4_LENGTH                     0x00000001

#define _ANSELD_ANSD5_POSITION                   0x00000005
#define _ANSELD_ANSD5_MASK                       0x00000020
#define _ANSELD_ANSD5_LENGTH                     0x00000001

#define _ANSELD_ANSD6_POSITION                   0x00000006
#define _ANSELD_ANSD6_MASK                       0x00000040
#define _ANSELD_ANSD6_LENGTH                     0x00000001

#define _ANSELD_ANSD7_POSITION                   0x00000007
#define _ANSELD_ANSD7_MASK                       0x00000080
#define _ANSELD_ANSD7_LENGTH                     0x00000001

#define _ANSELD_ANSD8_POSITION                   0x00000008
#define _ANSELD_ANSD8_MASK                       0x00000100
#define _ANSELD_ANSD8_LENGTH                     0x00000001

#define _ANSELD_ANSD9_POSITION                   0x00000009
#define _ANSELD_ANSD9_MASK                       0x00000200
#define _ANSELD_ANSD9_LENGTH                     0x00000001

#define _ANSELD_ANSD10_POSITION                  0x0000000A
#define _ANSELD_ANSD10_MASK                      0x00000400
#define _ANSELD_ANSD10_LENGTH                    0x00000001

#define _ANSELD_ANSD11_POSITION                  0x0000000B
#define _ANSELD_ANSD11_MASK                      0x00000800
#define _ANSELD_ANSD11_LENGTH                    0x00000001

#define _ANSELD_ANSD12_POSITION                  0x0000000C
#define _ANSELD_ANSD12_MASK                      0x00001000
#define _ANSELD_ANSD12_LENGTH                    0x00000001

#define _ANSELD_ANSD13_POSITION                  0x0000000D
#define _ANSELD_ANSD13_MASK                      0x00002000
#define _ANSELD_ANSD13_LENGTH                    0x00000001

#define _ANSELD_ANSD14_POSITION                  0x0000000E
#define _ANSELD_ANSD14_MASK                      0x00004000
#define _ANSELD_ANSD14_LENGTH                    0x00000001

#define _ANSELD_ANSD15_POSITION                  0x0000000F
#define _ANSELD_ANSD15_MASK                      0x00008000
#define _ANSELD_ANSD15_LENGTH                    0x00000001

#define _ANSELD_ANSELD0_POSITION                 0x00000000
#define _ANSELD_ANSELD0_MASK                     0x00000001
#define _ANSELD_ANSELD0_LENGTH                   0x00000001

