MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB412/mcu.h
#define _IOCNE_IOCNE8_POSITION                   0x00000008
#define _IOCNE_IOCNE8_MASK                       0x00000100
#define _IOCNE_IOCNE8_LENGTH                     0x00000001

#define _IOCNE_IOCNE9_POSITION                   0x00000009
#define _IOCNE_IOCNE9_MASK                       0x00000200
#define _IOCNE_IOCNE9_LENGTH                     0x00000001

#define _IOCFE_IOCFE0_POSITION                   0x00000000
#define _IOCFE_IOCFE0_MASK                       0x00000001
#define _IOCFE_IOCFE0_LENGTH                     0x00000001

#define _IOCFE_IOCFE1_POSITION                   0x00000001
#define _IOCFE_IOCFE1_MASK                       0x00000002
#define _IOCFE_IOCFE1_LENGTH                     0x00000001

#define _IOCFE_IOCFE2_POSITION                   0x00000002
#define _IOCFE_IOCFE2_MASK                       0x00000004
#define _IOCFE_IOCFE2_LENGTH                     0x00000001

#define _IOCFE_IOCFE3_POSITION                   0x00000003
#define _IOCFE_IOCFE3_MASK                       0x00000008
#define _IOCFE_IOCFE3_LENGTH                     0x00000001

#define _IOCFE_IOCFE4_POSITION                   0x00000004
#define _IOCFE_IOCFE4_MASK                       0x00000010
#define _IOCFE_IOCFE4_LENGTH                     0x00000001

#define _IOCFE_IOCFE5_POSITION                   0x00000005
#define _IOCFE_IOCFE5_MASK                       0x00000020
#define _IOCFE_IOCFE5_LENGTH                     0x00000001

#define _IOCFE_IOCFE6_POSITION                   0x00000006
#define _IOCFE_IOCFE6_MASK                       0x00000040
#define _IOCFE_IOCFE6_LENGTH                     0x00000001

#define _IOCFE_IOCFE7_POSITION                   0x00000007
#define _IOCFE_IOCFE7_MASK                       0x00000080
#define _IOCFE_IOCFE7_LENGTH                     0x00000001

#define _IOCFE_IOCFE8_POSITION                   0x00000008
#define _IOCFE_IOCFE8_MASK                       0x00000100
#define _IOCFE_IOCFE8_LENGTH                     0x00000001

#define _IOCFE_IOCFE9_POSITION                   0x00000009
#define _IOCFE_IOCFE9_MASK                       0x00000200
#define _IOCFE_IOCFE9_LENGTH                     0x00000001

#define _CNPUE_IOCPE0_POSITION                   0x00000000
#define _CNPUE_IOCPE0_MASK                       0x00000001
#define _CNPUE_IOCPE0_LENGTH                     0x00000001

#define _CNPUE_IOCPE1_POSITION                   0x00000001
#define _CNPUE_IOCPE1_MASK                       0x00000002
#define _CNPUE_IOCPE1_LENGTH                     0x00000001

#define _CNPUE_IOCPE2_POSITION                   0x00000002
#define _CNPUE_IOCPE2_MASK                       0x00000004
#define _CNPUE_IOCPE2_LENGTH                     0x00000001

#define _CNPUE_IOCPE3_POSITION                   0x00000003
#define _CNPUE_IOCPE3_MASK                       0x00000008
#define _CNPUE_IOCPE3_LENGTH                     0x00000001

#define _CNPUE_IOCPE4_POSITION                   0x00000004
#define _CNPUE_IOCPE4_MASK                       0x00000010
#define _CNPUE_IOCPE4_LENGTH                     0x00000001

#define _CNPUE_IOCPE5_POSITION                   0x00000005
#define _CNPUE_IOCPE5_MASK                       0x00000020
#define _CNPUE_IOCPE5_LENGTH                     0x00000001

#define _CNPUE_IOCPE6_POSITION                   0x00000006
#define _CNPUE_IOCPE6_MASK                       0x00000040
#define _CNPUE_IOCPE6_LENGTH                     0x00000001

#define _CNPUE_IOCPE7_POSITION                   0x00000007
#define _CNPUE_IOCPE7_MASK                       0x00000080
#define _CNPUE_IOCPE7_LENGTH                     0x00000001

#define _CNPUE_IOCPE8_POSITION                   0x00000008
#define _CNPUE_IOCPE8_MASK                       0x00000100
#define _CNPUE_IOCPE8_LENGTH                     0x00000001

#define _CNPUE_IOCPE9_POSITION                   0x00000009
#define _CNPUE_IOCPE9_MASK                       0x00000200
#define _CNPUE_IOCPE9_LENGTH                     0x00000001

#define _CNPUE_IOCPUE0_POSITION                  0x00000000
#define _CNPUE_IOCPUE0_MASK                      0x00000001
#define _CNPUE_IOCPUE0_LENGTH                    0x00000001

#define _CNPUE_IOCPUE1_POSITION                  0x00000001
#define _CNPUE_IOCPUE1_MASK                      0x00000002
#define _CNPUE_IOCPUE1_LENGTH                    0x00000001

#define _CNPUE_IOCPUE2_POSITION                  0x00000002
#define _CNPUE_IOCPUE2_MASK                      0x00000004
#define _CNPUE_IOCPUE2_LENGTH                    0x00000001

#define _CNPUE_IOCPUE3_POSITION                  0x00000003
#define _CNPUE_IOCPUE3_MASK                      0x00000008
#define _CNPUE_IOCPUE3_LENGTH                    0x00000001

#define _CNPUE_IOCPUE4_POSITION                  0x00000004
#define _CNPUE_IOCPUE4_MASK                      0x00000010
#define _CNPUE_IOCPUE4_LENGTH                    0x00000001

#define _CNPUE_IOCPUE5_POSITION                  0x00000005
#define _CNPUE_IOCPUE5_MASK                      0x00000020
#define _CNPUE_IOCPUE5_LENGTH                    0x00000001

#define _CNPUE_IOCPUE6_POSITION                  0x00000006
#define _CNPUE_IOCPUE6_MASK                      0x00000040
#define _CNPUE_IOCPUE6_LENGTH                    0x00000001

#define _CNPUE_IOCPUE7_POSITION                  0x00000007
#define _CNPUE_IOCPUE7_MASK                      0x00000080
#define _CNPUE_IOCPUE7_LENGTH                    0x00000001

#define _CNPUE_IOCPUE8_POSITION                  0x00000008
#define _CNPUE_IOCPUE8_MASK                      0x00000100
#define _CNPUE_IOCPUE8_LENGTH                    0x00000001

#define _CNPUE_IOCPUE9_POSITION                  0x00000009
#define _CNPUE_IOCPUE9_MASK                      0x00000200
#define _CNPUE_IOCPUE9_LENGTH                    0x00000001

#define _CNPUE_CNPUE0_POSITION                   0x00000000
#define _CNPUE_CNPUE0_MASK                       0x00000001
#define _CNPUE_CNPUE0_LENGTH                     0x00000001

#define _CNPUE_CNPUE1_POSITION                   0x00000001
#define _CNPUE_CNPUE1_MASK                       0x00000002
#define _CNPUE_CNPUE1_LENGTH                     0x00000001

#define _CNPUE_CNPUE2_POSITION                   0x00000002
#define _CNPUE_CNPUE2_MASK                       0x00000004
#define _CNPUE_CNPUE2_LENGTH                     0x00000001

#define _CNPUE_CNPUE3_POSITION                   0x00000003
#define _CNPUE_CNPUE3_MASK                       0x00000008
#define _CNPUE_CNPUE3_LENGTH                     0x00000001

