MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB412/mcu.h
/*
** Only one invocation of FSIGN should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSIGN.
** Multiple options may be combined, as shown:
**
** _FSIGN( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FOSCSEL (0xab98)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0xab98),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with PLL module (FRCPLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XTPLL, HSPLL, ECPLL)
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_FRCDIV         Fast RC Oscillator with divide-by-n (FRCDIV)
**
**   Frequency Multiplier Select Bits:
**     PLLMODE_PLL96DIV1    96 MHz PLL (4 MHz input)
**     PLLMODE_PLL96DIV2    96 MHz PLL (8 MHz input)
**     PLLMODE_PLL96DIV3    96 MHz PLL (12 MHz input)
**     PLLMODE_PLL96DIV4    96 MHz PLL (16 MHz input)
**     PLLMODE_PLL96DIV5    96 MHz PLL (20 MHz input)
**     PLLMODE_PLL96DIV6    96 MHz PLL (24 MHz input)
**     PLLMODE_PLL96DIV8    96 MHz PLL (32 MHz input)
**     PLLMODE_PLL96DIV12   96 MHz PLL (48 MHz input)
**     PLLMODE_PLL4X        4x PLL selected
**     PLLMODE_PLL6X        6x PLL selected
**     PLLMODE_PLL8X        8x PLL selected
**     PLLMODE_DISABLED     No PLL used; PLLEN bit is not available
**
**   Internal External Switchover:
**     IESO_OFF             Start up with user-selected oscillator source
**     IESO_ON              Start up device with FRC, then switch to user-selected oscillator source
**
*/

#define FNOSC_FRC            0x00F8
#define FNOSC_FRCPLL         0x00F9
#define FNOSC_PRI            0x00FA
#define FNOSC_PRIPLL         0x00FB
#define FNOSC_SOSC           0x00FC
#define FNOSC_LPRC           0x00FD
#define FNOSC_FRCDIV         0x00FF

#define PLLMODE_PLL96DIV1    0x0087
#define PLLMODE_PLL96DIV2    0x008F
#define PLLMODE_PLL96DIV3    0x0097
#define PLLMODE_PLL96DIV4    0x009F
#define PLLMODE_PLL96DIV5    0x00A7
#define PLLMODE_PLL96DIV6    0x00AF
#define PLLMODE_PLL96DIV8    0x00B7
#define PLLMODE_PLL96DIV12   0x00BF
#define PLLMODE_PLL4X        0x00E7
#define PLLMODE_PLL6X        0x00EF
#define PLLMODE_PLL8X        0x00F7
#define PLLMODE_DISABLED     0x00FF

#define IESO_OFF             0x007F
#define IESO_ON              0x00FF

/* Register FOSC (0xab9c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xab9c),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Select:
**     POSCMOD_EC           External clock mode selected
**     POSCMOD_XT           XT oscillator mode selected
**     POSCMOD_HS           HS Oscillator mode selected
**     POSCMOD_NONE         Primary Oscillator disabled
**
**   OSCO Pin Configuration:
**     OSCIOFCN_ON          OSCO/CLKO/RC15 functions as port I/O (RC15)
**     OSCIOFCN_OFF         OSCO/CLKO/RC15 functions as CLKO (FOSC/2)
**
**   SOSC Power Selection Configuration bits:
**     SOSCSEL_OFF          Digital (SCLKI) mode
**     SOSCSEL_ON           SOSC is used in crystal (SOSCI/SOSCO) mode
**
**   PLL Secondary Selection Configuration bit:
**     PLLSS_PLL_FRC        PLL is fed by the on-chip Fast RC (FRC) oscillator
**     PLLSS_PLL_PRI        PLL is fed by the Primary oscillator
**
**   IOLOCK One-Way Set Enable:
**     IOL1WAY_OFF          The IOLOCK bit can be set and cleared using the unlock sequence
**     IOL1WAY_ON           Once set the IOLOCK bit cannot be cleared
**
**   Clock Switching and Monitor Selection:
**     FCKSM_CSECME         Clock switching is enabled, Fail-Safe Clock Monitor is enabled
**     FCKSM_CSECMD         Clock switching is enabled, Fail-Safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Clock switching and Fail-Safe Clock Monitor are disabled
**
*/

#define POSCMOD_EC           0x00FC
#define POSCMOD_XT           0x00FD
#define POSCMOD_HS           0x00FE
#define POSCMOD_NONE         0x00FF

#define OSCIOFCN_ON          0x00FB
#define OSCIOFCN_OFF         0x00FF

#define SOSCSEL_OFF          0x00F7
#define SOSCSEL_ON           0x00FF

#define PLLSS_PLL_FRC        0x00EF
#define PLLSS_PLL_PRI        0x00FF

#define IOL1WAY_OFF          0x00DF
#define IOL1WAY_ON           0x00FF

#define FCKSM_CSECME         0x003F
#define FCKSM_CSECMD         0x007F
#define FCKSM_CSDCMD         0x00BF

/* Register FWDT (0xaba0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xaba0),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler:
**     WDTPS_PS1            1:1
**     WDTPS_PS2            1:2
**     WDTPS_PS4            1:4
**     WDTPS_PS8            1:8
**     WDTPS_PS16           1:16
**     WDTPS_PS32           1:32
**     WDTPS_PS64           1:64
**     WDTPS_PS128          1:128
**     WDTPS_PS256          1:256
**     WDTPS_PS512          1:512
**     WDTPS_PS1024         1:1,024
**     WDTPS_PS2048         1:2,048
**     WDTPS_PS4096         1:4,096
**     WDTPS_PS8192         1:8,192
**     WDTPS_PS16384        1:16,384
**     WDTPS_PS32768        1:32,768
**
**   WDT Prescaler:
**     FWPSA_PR32           Prescaler ratio of 1:32
**     FWPSA_PR128          Prescaler ratio of 1:128
**
**   Watchdog Timer Enable:
**     FWDTEN_OFF           Watchdog Timer is disabled
**     FWDTEN_NOSLP         WDT enabled only while device active and disabled in Sleep
**     FWDTEN_SWON          WDT controlled with the SWDTEN bit
**     FWDTEN_ON            Watchdog Timer is enabled
**
**   Windowed Watchdog Timer Disable bit:
**     WINDIS_ON            Windowed WDT enabled
**     WINDIS_OFF           Standard Watchdog Timer enabled (Windowed-mode is disabled)
**
**   Watchdog Window Select bits:
**     WDTWIN_PS75_0        Watch Dog Timer Window Width is 75 percent
**     WDTWIN_PS50_0        Watch Dog Timer Window Width is 50 percent
**     WDTWIN_PS37_5        Watch Dog Timer Window Width is 37.5 percent
**     WDTWIN_PS25_0        Watch Dog Timer Window Width is 25 percent
**
**   WDT Clock Source Select bits:
**     WDTCMX_LPRC          WDT always uses LPRC as its clock source
**     WDTCMX_WDTCLK        WDT clock source is determined by the WDTCLK Configuration bits
**
**   WDT Clock Source Select bits:
**     WDTCLK_SYSCLK        WDT uses system clock when active, LPRC while in Sleep mode
**     WDTCLK_SOSC          WDT uses SOSC input
**     WDTCLK_FRC           WDT uses 31 kHz source from FRC when active in Windowed WDT
**     WDTCLK_LPRC          WDT uses LPRC
**
*/

#define WDTPS_PS1            0x6BF0
#define WDTPS_PS2            0x6BF1
#define WDTPS_PS4            0x6BF2
#define WDTPS_PS8            0x6BF3
#define WDTPS_PS16           0x6BF4
#define WDTPS_PS32           0x6BF5
#define WDTPS_PS64           0x6BF6
#define WDTPS_PS128          0x6BF7
#define WDTPS_PS256          0x6BF8
#define WDTPS_PS512          0x6BF9
#define WDTPS_PS1024         0x6BFA
#define WDTPS_PS2048         0x6BFB
#define WDTPS_PS4096         0x6BFC
#define WDTPS_PS8192         0x6BFD
#define WDTPS_PS16384        0x6BFE
#define WDTPS_PS32768        0x6BFF

#define FWPSA_PR32           0x6BEF
#define FWPSA_PR128          0x6BFF

#define FWDTEN_OFF           0x6B9F
#define FWDTEN_NOSLP         0x6BBF
#define FWDTEN_SWON          0x6BDF
#define FWDTEN_ON            0x6BFF

#define WINDIS_ON            0x6B7F
#define WINDIS_OFF           0x6BFF

#define WDTWIN_PS75_0        0x68FF
#define WDTWIN_PS50_0        0x69FF
#define WDTWIN_PS37_5        0x6AFF
#define WDTWIN_PS25_0        0x6BFF

#define WDTCMX_LPRC          0x63FF
#define WDTCMX_WDTCLK        0x6BFF

#define WDTCLK_SYSCLK        0x0BFF
#define WDTCLK_SOSC          0x2BFF
#define WDTCLK_FRC           0x4BFF
#define WDTCLK_LPRC          0x6BFF

/* Register FPOR (0xaba4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0xaba4),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

